#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]

/* automatically generated by rust-bindgen */

pub const LIBIPMIMONITORING_VERSION_MAJOR: u32 = 1;
pub const LIBIPMIMONITORING_VERSION_MINOR: u32 = 0;
pub const LIBIPMIMONITORING_VERSION_PATCH: u32 = 9;
pub const ipmi_monitoring_error_codes_IPMI_MONITORING_ERR_SUCCESS: ipmi_monitoring_error_codes = 0;
pub const ipmi_monitoring_error_codes_IPMI_MONITORING_ERR_CTX_NULL: ipmi_monitoring_error_codes = 1;
pub const ipmi_monitoring_error_codes_IPMI_MONITORING_ERR_CTX_INVALID: ipmi_monitoring_error_codes =
    2;
pub const ipmi_monitoring_error_codes_IPMI_MONITORING_ERR_PARAMETERS: ipmi_monitoring_error_codes =
    3;
pub const ipmi_monitoring_error_codes_IPMI_MONITORING_ERR_PERMISSION: ipmi_monitoring_error_codes =
    4;
pub const ipmi_monitoring_error_codes_IPMI_MONITORING_ERR_LIBRARY_UNINITIALIZED:
    ipmi_monitoring_error_codes = 5;
pub const ipmi_monitoring_error_codes_IPMI_MONITORING_ERR_SEL_CONFIG_FILE_DOES_NOT_EXIST:
    ipmi_monitoring_error_codes = 6;
pub const ipmi_monitoring_error_codes_IPMI_MONITORING_ERR_SEL_CONFIG_FILE_PARSE:
    ipmi_monitoring_error_codes = 7;
pub const ipmi_monitoring_error_codes_IPMI_MONITORING_ERR_SENSOR_CONFIG_FILE_DOES_NOT_EXIST:
    ipmi_monitoring_error_codes = 8;
pub const ipmi_monitoring_error_codes_IPMI_MONITORING_ERR_SENSOR_CONFIG_FILE_PARSE:
    ipmi_monitoring_error_codes = 9;

pub const ipmi_monitoring_sel_flags_IPMI_MONITORING_SEL_FLAGS_ENTITY_SENSOR_NAMES:
    ipmi_monitoring_sel_flags = 8;
pub const ipmi_monitoring_sel_flags_IPMI_MONITORING_SEL_FLAGS_ASSUME_MAX_SDR_RECORD_COUNT:
    ipmi_monitoring_sel_flags = 16;
pub type ipmi_monitoring_sel_flags = u32;
pub const ipmi_monitoring_sensor_reading_flags_IPMI_MONITORING_SENSOR_READING_FLAGS_REREAD_SDR_CACHE : ipmi_monitoring_sensor_reading_flags = 1 ;
pub const ipmi_monitoring_sensor_reading_flags_IPMI_MONITORING_SENSOR_READING_FLAGS_IGNORE_NON_INTERPRETABLE_SENSORS : ipmi_monitoring_sensor_reading_flags = 2 ;
pub const ipmi_monitoring_sensor_reading_flags_IPMI_MONITORING_SENSOR_READING_FLAGS_BRIDGE_SENSORS : ipmi_monitoring_sensor_reading_flags = 4 ;
pub const ipmi_monitoring_sensor_reading_flags_IPMI_MONITORING_SENSOR_READING_FLAGS_INTERPRET_OEM_DATA : ipmi_monitoring_sensor_reading_flags = 8 ;
pub const ipmi_monitoring_sensor_reading_flags_IPMI_MONITORING_SENSOR_READING_FLAGS_SHARED_SENSORS : ipmi_monitoring_sensor_reading_flags = 16 ;
pub const ipmi_monitoring_sensor_reading_flags_IPMI_MONITORING_SENSOR_READING_FLAGS_DISCRETE_READING : ipmi_monitoring_sensor_reading_flags = 32 ;
pub const ipmi_monitoring_sensor_reading_flags_IPMI_MONITORING_SENSOR_READING_FLAGS_IGNORE_SCANNING_DISABLED : ipmi_monitoring_sensor_reading_flags = 64 ;
pub const ipmi_monitoring_sensor_reading_flags_IPMI_MONITORING_SENSOR_READING_FLAGS_ASSUME_BMC_OWNER : ipmi_monitoring_sensor_reading_flags = 128 ;
pub const ipmi_monitoring_sensor_reading_flags_IPMI_MONITORING_SENSOR_READING_FLAGS_ENTITY_SENSOR_NAMES : ipmi_monitoring_sensor_reading_flags = 256 ;
pub const ipmi_monitoring_sensor_reading_flags_IPMI_MONITORING_SENSOR_READING_FLAGS_ASSUME_MAX_SDR_RECORD_COUNT : ipmi_monitoring_sensor_reading_flags = 512 ;
pub const ipmi_monitoring_sensor_reading_flags_IPMI_MONITORING_SENSOR_READING_FLAGS_IGNORE_UNREADABLE_SENSORS : ipmi_monitoring_sensor_reading_flags = 2 ;
pub type ipmi_monitoring_sensor_reading_flags = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipmi_monitoring_ipmi_config {
    pub driver_type: ::std::os::raw::c_int,
    pub disable_auto_probe: ::std::os::raw::c_int,
    pub driver_address: ::std::os::raw::c_uint,
    pub register_spacing: ::std::os::raw::c_uint,
    pub driver_device: *mut ::std::os::raw::c_char,
    pub protocol_version: ::std::os::raw::c_int,
    pub username: *mut ::std::os::raw::c_char,
    pub password: *mut ::std::os::raw::c_char,
    pub k_g: *mut ::std::os::raw::c_uchar,
    pub k_g_len: ::std::os::raw::c_uint,
    pub privilege_level: ::std::os::raw::c_int,
    pub authentication_type: ::std::os::raw::c_int,
    pub cipher_suite_id: ::std::os::raw::c_int,
    pub session_timeout_len: ::std::os::raw::c_int,
    pub retransmission_timeout_len: ::std::os::raw::c_int,
    pub workaround_flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ipmi_monitoring_ipmi_config() {
    assert_eq!(
        ::std::mem::size_of::<ipmi_monitoring_ipmi_config>(),
        88usize,
        concat!("Size of: ", stringify!(ipmi_monitoring_ipmi_config))
    );
    assert_eq!(
        ::std::mem::align_of::<ipmi_monitoring_ipmi_config>(),
        8usize,
        concat!("Alignment of ", stringify!(ipmi_monitoring_ipmi_config))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).driver_type as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(driver_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).disable_auto_probe as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(disable_auto_probe)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).driver_address as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(driver_address)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).register_spacing as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(register_spacing)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).driver_device as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(driver_device)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).protocol_version as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(protocol_version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).username as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(username)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).password as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(password)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).k_g as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(k_g)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).k_g_len as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(k_g_len)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).privilege_level as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(privilege_level)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).authentication_type as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(authentication_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).cipher_suite_id as *const _
                as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(cipher_suite_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).session_timeout_len as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(session_timeout_len)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).retransmission_timeout_len
                as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(retransmission_timeout_len)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ipmi_monitoring_ipmi_config>())).workaround_flags as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ipmi_monitoring_ipmi_config),
            "::",
            stringify!(workaround_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipmi_monitoring_ctx {
    _unused: [u8; 0],
}
pub type ipmi_monitoring_ctx_t = *mut ipmi_monitoring_ctx;
pub type Ipmi_Monitoring_Callback = ::std::option::Option<
    unsafe extern "C" fn(
        c: ipmi_monitoring_ctx_t,
        callback_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn ipmi_monitoring_init(
        flags: ::std::os::raw::c_uint,
        errnum: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipmi_monitoring_ctx_create() -> ipmi_monitoring_ctx_t;
}
extern "C" {
    pub fn ipmi_monitoring_ctx_destroy(c: ipmi_monitoring_ctx_t);
}
extern "C" {
    pub fn ipmi_monitoring_ctx_errnum(c: ipmi_monitoring_ctx_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipmi_monitoring_ctx_strerror(
